// Copyright 2020 Bill Ticehurst. All rights reserved.
// Use of this source code is governed by the MIT license that can be
// found in the LICENSE file

// See https://docs.microsoft.com/en-us/windows/win32/winprog/windows-data-types
// Also https://docs.microsoft.com/en-us/windows/win32/debug/pe-format
#pragma once

#include "common.h"
#include "win-constants.h"

using BOOL      = int;
using BYTE      = unsigned char;
using CHAR      = char;
using DWORD     = unsigned int;
using LONG      = int;
using PVOID     = void*;
using SHORT     = short;
using ULONGLONG = unsigned long long;
using VOID      = void;
using WCHAR     = unsigned short;
using WORD      = unsigned short;

#define NTAPI
#define UNALIGNED

struct GUID {
    unsigned long  Data1;
    unsigned short Data2;
    unsigned short Data3;
    unsigned char  Data4[8];
};
static_assert(sizeof(GUID) == 16);
using CLSID = GUID;

struct IMAGE_DOS_HEADER {      // DOS .EXE header
    WORD e_magic;              // Magic number
    WORD e_cblp;               // Bytes on last page of file
    WORD e_cp;                 // Pages in file
    WORD e_crlc;               // Relocations
    WORD e_cparhdr;            // Size of header in paragraphs
    WORD e_minalloc;           // Minimum extra paragraphs needed
    WORD e_maxalloc;           // Maximum extra paragraphs needed
    WORD e_ss;                 // Initial (relative) SS value
    WORD e_sp;                 // Initial SP value
    WORD e_csum;               // Checksum
    WORD e_ip;                 // Initial IP value
    WORD e_cs;                 // Initial (relative) CS value
    WORD e_lfarlc;             // File address of relocation table
    WORD e_ovno;               // Overlay number
    WORD e_res[4];             // Reserved words
    WORD e_oemid;              // OEM identifier (for e_oeminfo)
    WORD e_oeminfo;            // OEM information; e_oemid specific
    WORD e_res2[10];           // Reserved words
    LONG e_lfanew;             // File address of new exe header
};
static_assert(sizeof(IMAGE_DOS_HEADER) == 64);

struct IMAGE_FILE_HEADER {
    WORD  Machine;
    WORD  NumberOfSections;
    DWORD TimeDateStamp;
    DWORD PointerToSymbolTable;
    DWORD NumberOfSymbols;
    WORD  SizeOfOptionalHeader;
    WORD  Characteristics;
};
static_assert(sizeof(IMAGE_FILE_HEADER) == 20);

struct IMAGE_DATA_DIRECTORY {
    DWORD   VirtualAddress;
    DWORD   Size;
};
#define IMAGE_NUMBEROF_DIRECTORY_ENTRIES    16

struct IMAGE_OPTIONAL_HEADER32 {
    //
    // Standard fields.
    //
    WORD    Magic;
    BYTE    MajorLinkerVersion;
    BYTE    MinorLinkerVersion;
    DWORD   SizeOfCode;
    DWORD   SizeOfInitializedData;
    DWORD   SizeOfUninitializedData;
    DWORD   AddressOfEntryPoint;
    DWORD   BaseOfCode;
    DWORD   BaseOfData;
    //
    // NT additional fields.
    //
    DWORD   ImageBase;
    DWORD   SectionAlignment;
    DWORD   FileAlignment;
    WORD    MajorOperatingSystemVersion;
    WORD    MinorOperatingSystemVersion;
    WORD    MajorImageVersion;
    WORD    MinorImageVersion;
    WORD    MajorSubsystemVersion;
    WORD    MinorSubsystemVersion;
    DWORD   Win32VersionValue;
    DWORD   SizeOfImage;
    DWORD   SizeOfHeaders;
    DWORD   CheckSum;
    WORD    Subsystem;
    WORD    DllCharacteristics;
    DWORD   SizeOfStackReserve;
    DWORD   SizeOfStackCommit;
    DWORD   SizeOfHeapReserve;
    DWORD   SizeOfHeapCommit;
    DWORD   LoaderFlags;
    DWORD   NumberOfRvaAndSizes;
    IMAGE_DATA_DIRECTORY DataDirectory[IMAGE_NUMBEROF_DIRECTORY_ENTRIES];
};
static_assert(sizeof(IMAGE_OPTIONAL_HEADER32) == 224);

struct IMAGE_OPTIONAL_HEADER64 {
    WORD        Magic;
    BYTE        MajorLinkerVersion;
    BYTE        MinorLinkerVersion;
    DWORD       SizeOfCode;
    DWORD       SizeOfInitializedData;
    DWORD       SizeOfUninitializedData;
    DWORD       AddressOfEntryPoint;
    DWORD       BaseOfCode;
    ULONGLONG   ImageBase;
    DWORD       SectionAlignment;
    DWORD       FileAlignment;
    WORD        MajorOperatingSystemVersion;
    WORD        MinorOperatingSystemVersion;
    WORD        MajorImageVersion;
    WORD        MinorImageVersion;
    WORD        MajorSubsystemVersion;
    WORD        MinorSubsystemVersion;
    DWORD       Win32VersionValue;
    DWORD       SizeOfImage;
    DWORD       SizeOfHeaders;
    DWORD       CheckSum;
    WORD        Subsystem;
    WORD        DllCharacteristics;
    ULONGLONG   SizeOfStackReserve;
    ULONGLONG   SizeOfStackCommit;
    ULONGLONG   SizeOfHeapReserve;
    ULONGLONG   SizeOfHeapCommit;
    DWORD       LoaderFlags;
    DWORD       NumberOfRvaAndSizes;
    IMAGE_DATA_DIRECTORY DataDirectory[IMAGE_NUMBEROF_DIRECTORY_ENTRIES];
};
static_assert(sizeof(IMAGE_OPTIONAL_HEADER64) == 240);

struct IMAGE_NT_HEADERS64 {
    DWORD Signature;
    IMAGE_FILE_HEADER FileHeader;
    IMAGE_OPTIONAL_HEADER64 OptionalHeader;
};

struct IMAGE_NT_HEADERS32 {
    DWORD Signature;
    IMAGE_FILE_HEADER FileHeader;
    IMAGE_OPTIONAL_HEADER32 OptionalHeader;
};

struct IMAGE_NT_HEADERS {
  DWORD Signature;
  IMAGE_FILE_HEADER FileHeader;
  union {
    IMAGE_OPTIONAL_HEADER32 _32;
    IMAGE_OPTIONAL_HEADER64 _64;
  } OptionalHeader;
};

struct IMAGE_SECTION_HEADER {
    BYTE    Name[8];
    union {
            DWORD   PhysicalAddress;
            DWORD   VirtualSize;
    } Misc;
    DWORD   VirtualAddress;
    DWORD   SizeOfRawData;         // Size of data for the section in the file
    DWORD   PointerToRawData;      // File offset where data for the section starts
    DWORD   PointerToRelocations;  // File offset to an array of IMAGE_RELOCATION structures if not 0. (.obj files only)
    DWORD   PointerToLinenumbers;
    WORD    NumberOfRelocations;   // Number of structures pointed to by PointerToRelocations
    WORD    NumberOfLinenumbers;
    DWORD   Characteristics;
};
static_assert(sizeof(IMAGE_SECTION_HEADER) == 40);

inline bool Is32Bit(IMAGE_NT_HEADERS* pe_header) {
    return pe_header->OptionalHeader._32.Magic == IMAGE_NT_OPTIONAL_HDR32_MAGIC;
}

inline IMAGE_DATA_DIRECTORY GetDataDirectory(IMAGE_NT_HEADERS* pe_header, int index) {
  if (Is32Bit(pe_header)) {
    return pe_header->OptionalHeader._32.DataDirectory[index];
  } else {
    return pe_header->OptionalHeader._64.DataDirectory[index];
  }
}

inline IMAGE_SECTION_HEADER* GetFirstSection(IMAGE_NT_HEADERS* nt_header) {
    // nt_header->FileHeader.NumberOfSections -> How many total sections
    uintptr_t result =
        (uintptr_t)nt_header + offsetof(IMAGE_NT_HEADERS32, OptionalHeader)
        + nt_header->FileHeader.SizeOfOptionalHeader;
    return (IMAGE_SECTION_HEADER*)result;
}

//
// DLL support.
//

// Export Format
struct IMAGE_EXPORT_DIRECTORY {
    DWORD   Characteristics;
    DWORD   TimeDateStamp;
    WORD    MajorVersion;
    WORD    MinorVersion;
